{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\rfinalModel.py\u00da\b<lambda>F\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "function_type": "lambda", "output_shape": null, "trainable": true, "name": "lambda_1", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 24, "border_mode": "same", "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 5, "trainable": true, "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 3, "trainable": true, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_4"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "init": "he_normal", "nb_row": 3, "trainable": true, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_5"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 2304, "activity_regularizer": null, "init": "he_normal", "b_constraint": null, "trainable": true, "b_regularizer": null, "output_dim": 1164, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": 1164, "activity_regularizer": null, "init": "he_normal", "b_constraint": null, "trainable": true, "b_regularizer": null, "output_dim": 100, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": 100, "activity_regularizer": null, "init": "he_normal", "b_constraint": null, "trainable": true, "b_regularizer": null, "output_dim": 50, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": 50, "activity_regularizer": null, "init": "he_normal", "b_constraint": null, "trainable": true, "b_regularizer": null, "output_dim": 10, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_4"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dense", "config": {"input_dim": 10, "activity_regularizer": null, "init": "he_normal", "b_constraint": null, "trainable": true, "b_regularizer": null, "output_dim": 1, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "name": "dense_5"}}], "keras_version": "1.2.0"}