{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "input_dtype": "float32", "output_shape": null, "trainable": true, "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "same", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "nb_filter": 24, "W_constraint": null, "name": "convolution2d_1", "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "nb_filter": 36, "W_constraint": null, "name": "convolution2d_2", "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "nb_filter": 48, "W_constraint": null, "name": "convolution2d_3", "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 3, "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_4", "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 3, "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "nb_filter": 64, "W_constraint": null, "name": "convolution2d_5", "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "input_dim": 2304, "output_dim": 1164, "init": "he_normal", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.4, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "input_dim": 1164, "output_dim": 100, "init": "he_normal", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_3", "input_dim": 100, "output_dim": 50, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_4", "input_dim": 50, "output_dim": 10, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "name": "dense_5", "input_dim": 10, "output_dim": 1, "init": "he_normal", "bias": true}}]}