{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape": null, "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_row": 5, "trainable": true, "W_regularizer": null, "nb_filter": 24, "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_1", "init": "he_normal", "nb_col": 5, "b_regularizer": null, "W_constraint": null, "border_mode": "same", "b_constraint": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_row": 5, "trainable": true, "W_regularizer": null, "nb_filter": 36, "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_2", "init": "he_normal", "nb_col": 5, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_row": 5, "trainable": true, "W_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_3", "init": "he_normal", "nb_col": 5, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 3, "trainable": true, "W_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_4", "init": "he_normal", "nb_col": 3, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 3, "trainable": true, "W_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "name": "convolution2d_5", "init": "he_normal", "nb_col": 3, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "b_constraint": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "output_dim": 1164, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "input_dim": 2304, "b_regularizer": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "output_dim": 100, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "input_dim": 1164, "b_regularizer": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "output_dim": 50, "activity_regularizer": null, "activation": "linear", "name": "dense_3", "input_dim": 100, "b_regularizer": null, "b_constraint": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "output_dim": 10, "activity_regularizer": null, "activation": "linear", "name": "dense_4", "input_dim": 50, "b_regularizer": null, "b_constraint": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "init": "he_normal", "output_dim": 1, "activity_regularizer": null, "activation": "linear", "name": "dense_5", "input_dim": 10, "b_regularizer": null, "b_constraint": null, "bias": true}}]}