{"keras_version": "1.2.0", "config": [{"config": {"arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "name": "lambda_1", "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"subsample": [2, 2], "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "same", "nb_row": 5, "nb_col": 5, "W_regularizer": null, "init": "he_normal", "nb_filter": 24, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "nb_row": 5, "nb_col": 5, "W_regularizer": null, "init": "he_normal", "nb_filter": 36, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "nb_row": 5, "nb_col": 5, "W_regularizer": null, "init": "he_normal", "nb_filter": 48, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "W_regularizer": null, "init": "he_normal", "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "W_constraint": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "W_regularizer": null, "init": "he_normal", "nb_filter": 64, "bias": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1164, "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "he_normal", "bias": true, "input_dim": 2304}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.4}, "class_name": "Dropout"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 100, "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "he_normal", "bias": true, "input_dim": 1164}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 50, "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "he_normal", "bias": true, "input_dim": 100}, "class_name": "Dense"}, {"config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 10, "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "he_normal", "bias": true, "input_dim": 50}, "class_name": "Dense"}, {"config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"output_dim": 1, "b_regularizer": null, "activation": "linear", "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "W_constraint": null, "trainable": true, "W_regularizer": null, "init": "he_normal", "bias": true, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}