{"keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda", "trainable": true, "output_shape": null, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "border_mode": "same", "nb_filter": 24, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_col": 5, "init": "he_normal", "name": "convolution2d_1", "trainable": true, "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_filter": 36, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_col": 5, "init": "he_normal", "name": "convolution2d_2", "trainable": true, "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_filter": 48, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_col": 5, "init": "he_normal", "name": "convolution2d_3", "trainable": true, "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_col": 3, "init": "he_normal", "name": "convolution2d_4", "trainable": true, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_regularizer": null, "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "bias": true, "b_regularizer": null, "nb_col": 3, "init": "he_normal", "name": "convolution2d_5", "trainable": true, "nb_row": 3}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "input_dim": 2304, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "he_normal", "output_dim": 1164, "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_1", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "input_dim": 1164, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "he_normal", "output_dim": 100, "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_3", "input_dim": 100, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "he_normal", "output_dim": 50, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_4", "input_dim": 50, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "he_normal", "output_dim": 10, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_5", "input_dim": 10, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "bias": true, "b_regularizer": null, "init": "he_normal", "output_dim": 1, "activation": "linear"}}], "class_name": "Sequential"}