{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0016\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "input_dtype": "float32", "arguments": {}, "trainable": true, "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "activation": "linear", "b_constraint": null, "nb_filter": 24, "W_regularizer": null, "border_mode": "same", "activity_regularizer": null, "bias": true, "subsample": [2, 2], "init": "he_normal", "trainable": true, "name": "convolution2d_1", "nb_col": 5, "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "activation": "linear", "b_constraint": null, "nb_filter": 36, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "bias": true, "subsample": [2, 2], "init": "he_normal", "trainable": true, "name": "convolution2d_2", "nb_col": 5, "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "activation": "linear", "b_constraint": null, "nb_filter": 48, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "bias": true, "subsample": [2, 2], "init": "he_normal", "trainable": true, "name": "convolution2d_3", "nb_col": 5, "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "activation": "linear", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "bias": true, "subsample": [1, 1], "init": "he_normal", "trainable": true, "name": "convolution2d_4", "nb_col": 3, "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "activation": "linear", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "bias": true, "subsample": [1, 1], "init": "he_normal", "trainable": true, "name": "convolution2d_5", "nb_col": 3, "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 1164, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 2304, "init": "he_normal", "trainable": true, "name": "dense_1", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_1", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 100, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 1164, "init": "he_normal", "trainable": true, "name": "dense_2", "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 50, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 100, "init": "he_normal", "trainable": true, "name": "dense_3", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 10, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 50, "init": "he_normal", "trainable": true, "name": "dense_4", "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 1, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "bias": true, "input_dim": 10, "init": "he_normal", "trainable": true, "name": "dense_5", "b_regularizer": null}}]}